semestr1/logika/zwiazki-log-miedzy-zdaniami.md

# Table of Contents

1.  [związki logiczne między zdaniami :: związki analityczne miedzy zdaniami uwarunkowane wyłącznie strukturą tych zdaniem i znaczeniem wystepujach w nich stałych logicznych](#org4b9fd08)
2.  [czy pierwsze z wymienionych zdań wynika logicznie z pozostałych?](#orgbe07986)



<a id="org4b9fd08"></a>

# związki logiczne między zdaniami :: związki analityczne miedzy zdaniami uwarunkowane wyłącznie strukturą tych zdaniem i znaczeniem wystepujach w nich stałych logicznych

**\* wynikanie logiczne :: determinowany przy pomocy prawdy logicznej; ze zdań a1, a2 .. an -> b <=> (a1 i a2 i .. an) -> b jest prawdą logiczną (tautologią) 
\*** równoważnosć logiczna :: zdanie a jest równoważne ze zdaniem b witwg a <=> b jest tautologią ?
**\* sprzeczność logiczna :: zdanie a jest sprzeczne ze zdaniem b  witwg a <=> ~b jest atutologią ?
\*** logiczne wykluczanie sie :: zdanie a wyklucza się logicznie ze zdaniem b witwg a -> ~b jest tautologią
\*\* logiczne dopełnianie się :: zdanie a dopełnia się logicznie ze zdaniem b witwg ~a -> b jest tautologią


<a id="orgbe07986"></a>

# czy pierwsze z wymienionych zdań wynika logicznie z pozostałych?

-   Jan nie donosi na Piotra lub Piotr sie tego nie domyśla
-   Jeżeli Jan donosi na Piotra, to jezeli Piotr sie tego domyśla to przestanie ufać Janowi
-   Piotr nie przestanie ufać Janowi

